## Final Project Submission

Please fill out:
* Student name: Ian Kiptoo
* Student pace: Full time Remote
* Scheduled project review date/time: 
* Instructor name: Asha Dean
* Blog post URL:

In [1]:
# Your code here - remember to use markdown cells for comments as well!

# 1.  Introduction
## 1.1 Overview
This project will entail using exploratory data analysis (EDA) to try and come up with useful insights that will be used by Microsoft to make informed bussiness decisions.
This is in regard to entering into a new market of origanal video production.

## 1.2 Business Understanding

Microsoft aims to gain a foothold in the film industry by launching its own film studio. However, lacking experience in film production, Microsoft sought to understand successful films to inform its strategy. By conducting exploratory data analysis (EDA), the project aims to identify key factors contributing to box office success, such as genre preferences, demographics and key responses. The insights gained will enable Microsoft to make informed decisions about the types of films to be released based on market trends and audience preferences. Ultimately, this move is intended to make Microsoft Movie Studios more competitive in the changing entertainment market.

## 1.3 Revieving my current working directory

In [2]:
ls

 Volume in drive C has no label.
 Volume Serial Number is 4298-8E60

 Directory of C:\Users\Ian\Documents\fraiton\dsc-data-science-env-config\dsc-phase-1-project-v2-4

03/18/2024  22:19    <DIR>          .
03/18/2024  22:19    <DIR>          ..
03/18/2024  19:27               163 .canvas
03/18/2024  19:27                84 .gitignore
03/18/2024  19:44    <DIR>          .ipynb_checkpoints
03/18/2024  19:27         1,425,341 awesome.gif
03/18/2024  19:27             1,846 CONTRIBUTING.md
03/18/2024  22:13                 0 im.db
03/18/2024  19:27             1,357 LICENSE.md
03/18/2024  19:27           107,563 movie_data_erd.jpeg
03/18/2024  19:27            22,781 README.md
03/18/2024  22:19            30,766 student.ipynb
03/18/2024  22:20    <DIR>          zippedData
               9 File(s)      1,589,901 bytes
               4 Dir(s)  47,052,525,568 bytes free

## 1.4 Importing all the relevant Libraries

In [3]:
import pandas as pd
import numpy as np
import sqlite3
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

## 2. Data Understanding and Data Analysis

## 2.1 Reading the data

In [4]:
#Load the Box Office Data as Box_Office_df
Box_Office_df = pd.read_csv("ZippedData/bom.movie_gross.csv.gz")
Box_Office_df.head()

,title,studio,domestic_gross,foreign_gross,year
0,Toy Story 3,BV,415000000.0,652000000,2010
1,Alice in Wonderland (2010),BV,334200000.0,691300000,2010
2,Harry Potter and the Deathly Hallows Part 1,WB,296000000.0,664300000,2010
3,Inception,WB,292600000.0,535700000,2010
4,Shrek Forever After,P/DW,238700000.0,513900000,2010

In [5]:
# Connected to IMDB database

conn = sqlite3.connect('zippedData/im.db')
cur = conn.cursor()

In [6]:
# Imported our various CSV's to understand contents as well

df1 = pd.read_csv('zippedData/bom.movie_gross.csv.gz')
df2 = pd.read_csv('zippedData/rt.movie_info.tsv.gz', delimiter = '\t')
df3 = pd.read_csv('zippedData/tmdb.movies.csv.gz')
df4 = pd.read_csv('zippedData/tn.movie_budgets.csv.gz')

In [7]:
df1.head()

,title,studio,domestic_gross,foreign_gross,year
0,Toy Story 3,BV,415000000.0,652000000,2010
1,Alice in Wonderland (2010),BV,334200000.0,691300000,2010
2,Harry Potter and the Deathly Hallows Part 1,WB,296000000.0,664300000,2010
3,Inception,WB,292600000.0,535700000,2010
4,Shrek Forever After,P/DW,238700000.0,513900000,2010

In [8]:
df2.head()

,id,synopsis,rating,genre,director,writer,theater_date,dvd_date,currency,box_office,runtime,studio
0,1,"This gritty, fast-paced, and innovative police...",R,Action and Adventure|Classics|Drama,William Friedkin,Ernest Tidyman,"Oct 9, 1971","Sep 25, 2001",NaN,NaN,104 minutes,NaN
1,3,"New York City, not-too-distant-future: Eric Pa...",R,Drama|Science Fiction and Fantasy,David Cronenberg,David Cronenberg|Don DeLillo,"Aug 17, 2012","Jan 1, 2013",$,"600,000",108 minutes,Entertainment One
2,5,Illeana Douglas delivers a superb performance ...,R,Drama|Musical and Performing Arts,Allison Anders,Allison Anders,"Sep 13, 1996","Apr 18, 2000",NaN,NaN,116 minutes,NaN
3,6,Michael Douglas runs afoul of a treacherous su...,R,Drama|Mystery and Suspense,Barry Levinson,Paul Attanasio|Michael Crichton,"Dec 9, 1994","Aug 27, 1997",NaN,NaN,128 minutes,NaN
4,7,NaN,NR,Drama|Romance,Rodney Bennett,Giles Cooper,NaN,NaN,NaN,NaN,200 minutes,NaN

In [9]:
df3.head()

,Unnamed: 0,genre_ids,id,original_language,original_title,popularity,release_date,title,vote_average,vote_count
0,0,"[12, 14, 10751]",12444,en,Harry Potter and the Deathly Hallows: Part 1,33.533,2010-11-19,Harry Potter and the Deathly Hallows: Part 1,7.7,10788
1,1,"[14, 12, 16, 10751]",10191,en,How to Train Your Dragon,28.734,2010-03-26,How to Train Your Dragon,7.7,7610
2,2,"[12, 28, 878]",10138,en,Iron Man 2,28.515,2010-05-07,Iron Man 2,6.8,12368
3,3,"[16, 35, 10751]",862,en,Toy Story,28.005,1995-11-22,Toy Story,7.9,10174
4,4,"[28, 878, 12]",27205,en,Inception,27.920,2010-07-16,Inception,8.3,22186

In [10]:
df4.head()

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,1,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279"
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875"
2,3,"Jun 7, 2019",Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350"
3,4,"May 1, 2015",Avengers: Age of Ultron,"$330,600,000","$459,005,868","$1,403,013,963"
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,"$317,000,000","$620,181,382","$1,316,721,747"

In [11]:
# Connected to IMDB database

conn = sqlite3.connect('zippedData/im.db.gz')
cur = conn.cursor()

In [12]:
# Wanted to know the schema of our IMDB database to understand tables

schema_df5 = pd.read_sql("""

SELECT *
    FROM sqlite_master

""", conn)

schema_df5

Empty DataFrame
Columns: [type, name, tbl_name, rootpage, sql]
Index: []

In [13]:
import pandas as pd
import sqlite3

# Connect to the SQLite database
conn = sqlite3.connect('zippedData/im.db')

# Query the schema of the database
schema_df5 = pd.read_sql("""
    SELECT type, name, tbl_name, rootpage, sql
    FROM sqlite_master
""", conn)

# Display the schema DataFrame
print(schema_df5)

Empty DataFrame
Columns: [type, name, tbl_name, rootpage, sql]
Index: []

In [16]:
# Create a connection to the dataset
conn = sqlite3.connect("C:\\Users\\Ian\\Documents\\fraiton\\dsc-data-science-env-config\\dsc-phase-1-project-v2-4\\im.db\\im.db")
# Check the names of the tables in the dataset
df5 = pd.read_sql("""SELECT name FROM sqlite_master WHERE type = 'table';""", conn)
df5

OperationalError: unable to open database file

In [15]:
pwd

'C:\\Users\\Ian\\Documents\\fraiton\\dsc-data-science-env-config\\dsc-phase-1-project-v2-4'

In [17]:
import sqlite3

# Corrected file path
db_file_path = "C:\\Users\\Ian\\Documents\\fraiton\\dsc-data-science-env-config\\dsc-phase-1-project-v2-4\\im.db"

# Create a connection to the dataset
conn = sqlite3.connect(db_file_path)

# Check the names of the tables in the dataset
df5 = pd.read_sql("""SELECT name FROM sqlite_master WHERE type = 'table';""", conn)
df5

Empty DataFrame
Columns: [name]
Index: []